#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
envs/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/terraform-play/terraform-play/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/terraform-play/terraform-play

To view this run in a browser, visit:
https://app.terraform.io/app/utwo/terra-play/runs/run-tvr6Vi8Nxb2BuBVJ

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.web_app.random_password.password: Refreshing state... [id=none]
module.web_app.data.google_compute_network.default: Reading...
module.web_app.google_service_account.cloud_run_service_account: Refreshing state... [id=projects/autocode-347209/serviceAccounts/cloud-run-sa@autocode-347209.iam.gserviceaccount.com]
module.web_app.google_project_service.services["sqladmin.googleapis.com"]: Refreshing state... [id=autocode-347209/sqladmin.googleapis.com]
module.web_app.google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=autocode-347209/cloudresourcemanager.googleapis.com]
module.web_app.data.google_billing_account.billing_account: Reading...
module.web_app.google_project_service.services["vpcaccess.googleapis.com"]: Refreshing state... [id=autocode-347209/vpcaccess.googleapis.com]
module.web_app.google_secret_manager_secret.db_password: Refreshing state... [id=projects/autocode-347209/secrets/db_password]
module.web_app.google_storage_bucket.assets: Refreshing state... [id=terraform-play-assets-dev]
module.web_app.google_vpc_access_connector.cloudrun_vpc_serverless: Refreshing state... [id=projects/autocode-347209/locations/europe-west1/connectors/cloudrun-vpc-serverless]
module.web_app.google_redis_instance.cache: Refreshing state... [id=projects/autocode-347209/locations/europe-west1/instances/redis-cache]
module.web_app.google_project_service.services["billingbudgets.googleapis.com"]: Refreshing state... [id=autocode-347209/billingbudgets.googleapis.com]
module.web_app.google_project_service.services["redis.googleapis.com"]: Refreshing state... [id=autocode-347209/redis.googleapis.com]
module.web_app.google_project_service.services["secretmanager.googleapis.com"]: Refreshing state... [id=autocode-347209/secretmanager.googleapis.com]
module.web_app.data.google_compute_network.default: Read complete after 1s [id=projects/autocode-347209/global/networks/default]
module.web_app.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=autocode-347209/iam.googleapis.com]
module.web_app.data.google_billing_account.billing_account: Read complete after 1s [id=01736B-DC780C-7D6C0B]
module.web_app.google_secret_manager_secret_version.db_password_data: Refreshing state... [id=projects/491168878032/secrets/db_password/versions/2]
module.web_app.google_storage_bucket_iam_member.all_users_read: Refreshing state... [id=b/terraform-play-assets-dev/roles/storage.legacyBucketWriter/allUsers]
module.web_app.google_storage_bucket_iam_member.cloud_run_member: Refreshing state... [id=b/terraform-play-assets-dev/roles/storage.admin/serviceAccount:cloud-run-sa@autocode-347209.iam.gserviceaccount.com]
module.web_app.google_billing_budget.budget: Refreshing state... [id=billingAccounts/01736B-DC780C-7D6C0B/budgets/ca9c1fe4-b8bb-4ca0-afa0-82a326d97268]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.web_app.google_cloud_run_service.web_app_backend will be created
  + resource "google_cloud_run_service" "web_app_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "web_app_backend"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"         = "15"
                  + "run.googleapis.com/execution-environment" = "gen2"
                  + "run.googleapis.com/launch-stage"          = "BETA"
                  + "run.googleapis.com/vpc-access-connector"  = "cloudrun-vpc-serverless"
                  + "run.googleapis.com/vpc-access-egress"     = "private-ranges-only"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "app" = "terraform-play"
                  + "env" = "dev"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "cloud-run-sa@autocode-347209.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 3000

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name  = "APP_ENV"
                      + value = "dev"
                    }
                  + env {
                      + name  = "BCUKET_NAME"
                      + value = "terraform-play-assets-dev"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "terradb-dev"
                    }
                  + env {
                      + name = "DB_PASSWORD"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "db_password"
                            }
                        }
                    }
                  + env {
                      + name  = "DB_USERNAME"
                      + value = "admin"
                    }
                  + env {
                      + name  = "NODE_ENV"
                      + value = "production"
                    }
                  + env {
                      + name  = "REDIS_HOST"
                      + value = "10.168.76.123"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.web_app.google_cloud_run_service_iam_member.cloudrun_all_users will be created
  + resource "google_cloud_run_service_iam_member" "cloudrun_all_users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "web_app_backend"
    }

  # module.web_app.google_project_service.services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.web_app.google_secret_manager_secret_iam_member.db_secret_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:cloud-run-sa@autocode-347209.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "projects/autocode-347209/secrets/db_password"
    }

  # module.web_app.google_sql_database.terra_db will be created
  + resource "google_sql_database" "terra_db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "terra-db"
      + name      = "terradb-dev"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.web_app.google_sql_database_instance.terra_instance will be created
  + resource "google_sql_database_instance" "terra_instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_14"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "terra-db"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "europe-west1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + point_in_time_recovery_enabled = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = "projects/autocode-347209/global/networks/default"

              + authorized_networks {
                  + name  = "allow all"
                  + value = "0.0.0.0/0"
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.web_app.google_sql_user.local_user will be created
  + resource "google_sql_user" "local_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "terra-db"
      + name     = "admin"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.web_app.google_sql_user.webapp_user will be created
  + resource "google_sql_user" "webapp_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "terra-db"
      + name     = "cloud-run-sa@autocode-347209.iam.gserviceaccount.com"
      + project  = (known after apply)
      + type     = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

Plan: 8 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @Utwo, Action: `pull_request`*